# language: ru
Функционал: Примесь рдобы
   Сценарий: Провѣрка подпримѣси пуздро
      Допустим ꙇє примѣнена подпримѣсь пуздро бисера рдоба
      Если къ кирилическу слову въ верхнемъ пуздрѣ ꙇє примѣненъ приꙇомъ :ниспуздри
      То кирилическо слово имаꙇє буквы въ нижнемъ пуздрѣ
      Если къ кирилическу слову въ нижнемъ пуздрѣ ꙇє примѣненъ приꙇомъ :воспуздри
      То кирилическо слово имаꙇє буквы въ верхнемъ пуздрѣ
      Если къ кирилическу слову въ смѣшанѣмъ пуздрѣ ꙇє примѣненъ приꙇомъ :воспуздри
      То кирилическо слово имаꙇє буквы въ верхнемъ пуздрѣ
      Если къ латыньску слову въ верхнемъ пуздрѣ ꙇє примѣненъ приꙇомъ :ниспуздри
      То латыньско слово имаꙇє буквы въ нижнемъ пуздрѣ
      Если къ латыньску слову въ нижнемъ пуздрѣ ꙇє примѣненъ приꙇомъ :воспуздри
      То латыньско слово имаꙇє буквы въ верхнемъ пуздрѣ
      Если къ кирилическу слову въ смѣшанѣмъ пуздрѣ ꙇє примѣненъ приꙇомъ :ниспуздри
      То кирилическо слово имаꙇє буквы въ пуздрѣ пуздрѣ

   Сценарий: Провѣрка подпримѣси обратка
      Допустим ꙇє примѣнена подпримесь обратка бисера рдоба
   Сценарий: Провѣрка подпримѣси ли_пущь
      Допустим ꙇє примѣнена подпримесь ли_пущь бисера рдоба
   Сценарий: Провѣрка подпримѣси во_сл
      Допустим ꙇє примѣнена подпримесь во_сл бисера рдоба
   Сценарий: Провѣрка подпримѣси сравнена
      Допустим ꙇє примѣнена подпримесь сравнена бисера рдоба

