# language: ru
Функционал: Слово рдобы
   Сценарий: Провѣрка рода наборъ
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ наборъ
      И вызоваꙇє сѧ :еже методъ рода наборъ за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

   Сценарий: Провѣрка рода словникъ
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ словникъ
      И вызоваꙇє сѧ :еже методъ рода словникъ за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

   Сценарий: Провѣрка рода броиникъ
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ броиникъ
      И вызоваꙇє сѧ :еже методъ рода броиникъ за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

   Сценарий: Провѣрка рода папка
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ папка
      И вызоваꙇє сѧ :еже методъ рода папка за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

   Сценарий: Провѣрка рода вв
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ вв
      И вызоваꙇє сѧ :еже методъ рода вв за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

    Сценарий: Провѣрка рода весь
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ весь
      И вызоваꙇє сѧ :еже методъ рода весь за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

    Сценарий: Провѣрка рода струга
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ струга
      И вызоваꙇє сѧ :еже методъ рода струга за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

    Сценарий: Провѣрка рода окола
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ окола
      И вызоваꙇє сѧ :еже методъ рода окола за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь

    Сценарий: Провѣрка рода дводе
      Допустим ꙇє примѣненъ модуль слово бисера рдоба
      Если создаꙇе сѧ дводе
      И вызоваꙇє сѧ :еже методъ рода дводе за переброꙇениꙇе значене онагѡ
      То зрѣмы, оже плодъ робли ꙇє подобающь


